{"/oculink_m2_adapter/docs/":{"data":{"":" Specifications Design Manufacturing Results Conclusion "},"title":"Documentation"},"/oculink_m2_adapter/docs/conclusion/":{"data":{"":"","diy-or-buy#DIY or Buy?":"DIY Advantages Disadvantages Can reach PCIe 3.0 speeds Can be designed to fit in any enclosure Cheaper per-unit cost Can be modified with different connector (MCIO) Cannot reach PCIe 4.0 speeds Significant performance loss in synthetic benchmarks Expensive to manufacture when considering minimum order quantity of PCBs and components and soldering equipment Time consuming to manufacture especially including electrical testing Unclear if design needs overhaul to reach PCIe 4.0 without having equipment to test circuit at PCIe 4.0 speeds Buy Advantages Disadvantages Can reach PCIe 4.0 speeds Beats PCIe 3.0 adapters in synthetic benchmarks Flexible micro-coax can be bent to fit most scenarios Cost is low considering performance and quality of adapter Minimum length of adapter is 12cm which might make it too long even with bending Conclusion Image 25. Aliexpress M.2 Oculink PCIe 4.0 silver plated extension cable (source) Buying the Aliexpress M.2 Oculink PCIe 4.0 adapter is the much more sensible option. It works out of the box and requires minimal bending to fit into your enclosure. Also comes in a variety of lengths: [15cm, 20cm, 25cm, 30cm, 40cm]. ","future-plans#Future plans":" Check mini cool edge IO (MCIO) connector: Has a better official number of insertion cycles. Cables are designed officially for PCIe 4.0 speeds. Fix performance problems and see if PCIe 4.0 speeds can be reached. Redesign hatch plane and taper in flexible PCB design. Use a low loss dielectric to reduce dielectric losses at PCIe 4.0 speeds. Use smooth copper foil to reduce skin effect losses. Determine if there is a method to cheaply verify performance at PCIe 4.0 speeds. High frequency oscilloscopes (\u003e20GHz) required for PCIe testing are extremely expensive. Most low cost (\u003c$1000) and low frequency (\u003c200MHz) oscilloscopes are not useful for validating PCIe peformance. "},"title":"Conclusion"},"/oculink_m2_adapter/docs/design/":{"data":{"":" Reference designs Laptop measurements KiCAD \u0026 JLCPCB Single board design Flex connector design Transmission line OpenEMS "},"title":"Design"},"/oculink_m2_adapter/docs/design/flex_pcb/":{"data":{"":"","advantages#Advantages":"Benefits of vertical routing Vertical routing under M.2 2280 slot has a much wider room. Removes requirement to move high frequency PCIe signal traces onto a different layer. Avoiding additional via jumps which results in better signal integrity. PCIe lanes for both RX and TX have 1 via jump. This is an improvement for TX lanes over the single board design which have 2 via jumps. Allows adjustment of height offset of Oculink port for ideal positioning against side of laptop chassis. Benefits of flexible PCB connection Flex PCB is designed to bend unlike a fibre glass core which prevents possible damage.\nOculink port is on separate board which doesn’t have to bend avoiding any possible mechanical damage to the SMD pad connections. Allows for more flexible positioning of the Oculink port if there is some error in the measurements. Polyimide dielectric Flex PCB uses a polyimide core which potentially could have a low dielectric loss.\nOverall length of PCIe lanes is the same but majority is over the lower dielectric loss polyimide. Could improve signal integrity however this is difficult to verify without proper equipment. Flexibility of design Easier redesign if future changes need to be made.\nM.2 card board can be kept constant. Flex connector can be easily redesigned and cheaply made. Port board can be swapped if Oculink port is damaged. Port board can be re-engineered to use a different PCIe compatible port like MCIO. Lower manufacturing cost. Cheaper overall manufacturing compared to single board design (using JLCPCB).\nM.2 card is only 22mm x 42mm which is under 50mm x 50mm threshold resulting in $2.00USD board cost. M.2 card is 0.8mm which means mandatory lead free HASL that costs $4.80USD. Oculink port board is only 21mm x 87mm which is under the 100mm x 100mm threshold meaning no additional engineering fee. Oculink port board exceed 50mm x 50mm threshold which means board cost of $7.00USD. Oculink port board can be manufactured on a stackup thicker than 0.8mm enabling HASL with lead which is free. Flexible PCB connector can be manufactured at $2.00USD. Overall cost of $15.80USD. ","disadvantages#Disadvantages":"Variability in polyimide properties Flex PCB polyimide material comes in several varieties.\nNo guarantee that the polyimide used is a low dielectric loss formulation. JLCPCB datasheet for their polyimide supplier shows a dielectric loss which is still substantial. Due to thinner stackup the electric field strength is significantly higher over a thicker stackup on FR4. This high E-field magnitude can result in even greater dielectric losses. If this isn’t offset by a low loss polyimide dielectric then the flex pcb may perform much worse than routing on FR4. Transitioning transmission line geometry Flex pcb requires handling transition of transmission line from FR4 stackup to flex PCB stackup.\nRequires careful design to avoid impedance discontinuities at flex PCB connection. Involves designing transmission line tapers to maintain impedance target across connector transition. Transmission line design Transmission line design on flex pcb Flex pcb has a very thin dielectric core for easy bending.\nThin dielectric means transmission line needs to be designed with extremely thin traces. Calculations with a solid ground plane puts trace width at \u003c 0.05mm which is not manufacturable. Requires using a hatched ground plane to achieve target impedance at manufacturable 0.1mm trace width. Hatched ground plane needs very careful design considerations and is not trivial to design. Hatched ground plane design Design and manufacturing complexity Additional complexity due to multiple boards.\nMore difficult manufacturing and electrical testing due to additional soldering steps for flex connector. More difficult design since KiCAD doesn’t support multi-board designs necessitating multiple projects. Requires a more complicated project layout to support sharing of common resources like the flex connector footprint. Requires careful design to make sure design changes are reflected across all 3 board designs (M.2 card, flex connector, Oculink port board) to avoid miswiring. Potential EMI issues Use of hatched ground plane instead of solid ground plane in flexible connector results in worse shielding at higher frequencies determined by hatch gap size. Since flexible pcb is routed underneath a PCIe 4.0 x 4 SSD in the M.2 2280 slot it could mean the Oculink connection will interfere with the SSD. Not that likely interference will be significant since the SSD also has it’s own internal solid ground plane which should shield EMI between SSD and Oculink connection. Potential safety issue Flexible PCB is routed over the battery pack. In the event of a short in the Oculink connection the battery pack could be damaged and possibly ignite. Not that likely since PCIe connection carries low power signals and 3.3V rail isn’t used to deliver any signficant amount of power to the eGPU dock. ","images#Images":" Image 11. Custom M.2 to Oculink adapter with flex connector PCBs Image 12. Custom M.2 to Oculink adapter with flex connector 3D renders "},"title":"Flex connector design"},"/oculink_m2_adapter/docs/design/kicad_jlcpcb/":{"data":{"":"","generating-gerber-and-drill-files#Generating gerber and drill files":" Gerber and drill files must match what the fabricator expects. JLCPCB specifies instructions for KiCAD 7.0 as well as other versions. JLCPCB instructions to generate KiCAD 7 gerber and drill files (source) Verify output through local gerber viewer program before submitting. Final verification in JLCPCB online gerber viewer after uploading design. ","importing-design-constraints-into-kicad#Importing design constraints into KiCAD":" JLCPCB specifies manufacturing capabilities. JLCPCB manufacturing capabilities The values for certain constraints will vary depending on options you select for the number of layers, minimum via size and stackup type. KiCAD supports creating a design rules file to automatically check these manufacturing constraints to prevent submitting unmanufacturable designs to a fabricator. The design rules checker (DRC) can be triggered manually or is run automatically before generating gerber and drill files. Sample KiCAD design rules file ","reasons-to-use-jlcpcb#Reasons to use JLCPCB":" The cheapest PCB manufacturer. Offers plenty of discounts for extremely low prices. If you stay under certain size requirements the cost will remain exceptionally low. Inexpensive 0.8mm thick stackup which is required for M.2 edge connector. Only requires lead free HASL to be the mandatory surface finish which costs $4.80USD. Inexpensive board cost if certain size thresholds aren’t exceeded. For boards less than 50mm x 50mm board cost is only $2.00USD. For boards between 50mm x 50mm and 100mm x 100mm the board cost is $7.00USD. For boards above 100mm x 100mm there is an aditional engineering fee which costs $24.00USD. Inexpensive 4 layer boards which are important for maintaining solid ground plane if signal traces need to be routed on separate layers. Controlled impedance stackup to meet transmission line design requirements. Allows choosing denser more uniform fibre weaves to improve signal integrity in transmission lines. A non-uniform weave could cause problems if a differential trace were routed over it. Each side of the pair could be on a piece of the weave with different densities of fibres. This would mean each trace in the pair experiences a different dielectric constant. Since the speed of propagation is dependent on the dielectric constant, a skew in the time domain would be induced in the differential pair. PCIe standard has relatively ENIG (gold plating) to prevent oxidation of M.2 edge connector and flatter profile for more reliable reflow soldering. Flexible PCBs for designs that require large amounts of vertical routing. Very generous constraints minimum via sizes and pad pitch which is important for high frequency design where physical dimensions of traces, vias, and connector pitch can get very small. ","reasons-to-use-kicad#Reasons to use KiCAD":" Free and open source. No license required for usage. More than adequate for passive M.2 to Oculink adapter. Transmission line calculators are limited but there are plenty of more capable free and public options. Lacks high end simulation capabilities like Altium but open source substitutes are available. "},"title":"KiCAD \u0026 JLCPCB"},"/oculink_m2_adapter/docs/design/laptop_measurements/":{"data":{"":"","measurement-and-modelling#Measurement and modelling":" Image 6. Measurements and prototype layout for M.2 to Oculink adapter Image 7. 3D modelling of Lenovo 16arp8 based on measurements Modelling was done from a sparse set of measurements. After modelling was done arbitrary measurements of any feature could be done. Easier than measuring every possible dimension when needed. ","planning#Planning":" Longer M.2 2280 slot is used for high capacity SSD. Shorter M.2 2242 slot is available but in a less convenient location. Left speaker can be removed to make room for Oculink port. M.2 2242 slot has 1mm of clearance for bottom side passive components. Option 1: Very narrow 12mm gap between M.2 2280 connector and internal display connector for single board design for side Oculink port. Option 2: Vertical space underneath M.2 2280 slot for routing with a flex pcb design that has a side Oculink port. Option 3: Use vertical Oculink adapter and have port on bottom instead of side of laptop. Image 8. NFHK vertical M.2 to Oculink adapter card (source) "},"title":"Laptop measurements"},"/oculink_m2_adapter/docs/design/open_ems/":{"data":{"":" Hatched ground Taper For an explanation of how to run the parameter search refer to simulations/README.md. To understand how to use gerber2ems refer to williamyang98/gerber2ems. "},"title":"OpenEMS"},"/oculink_m2_adapter/docs/design/open_ems/hatched_ground/":{"data":{"":"","discussion#Discussion":" The average reflectance seemed to have a minimum offset of Γ = 0.1 which was probably due to the bad impedance match when transitioning from the solid ground plane to hatched ground plane in the simulation. Highly likely that this would also occur in our flexible PCB since there is also a similar transition at the soldered connection. Doesn’t simulate dielectric loss or skin effect which is important for predicting how lossy the design is, especially at higher frequencies where these effects are significant. Right now the gerber2ems script uses a perfect conductor as the metal material, however openEMS has ConductingSheet which simulates conductivity for lossy conductors. Both dielectric loss and skin effect losses increase at higher frequencies however conductivity is flat across all frequencies, which makes it unsuitable for simulating these lossy effects. ","parameter-search#Parameter search":" Figure 1. S-parameter results of parameterised search of hatched ground plane with a hatch width of 150um Figure 2. Reflectance results of parameterised search of hatched ground plane with a hatch width of 150um The configuration with the lowest mean energy loss in our frequency range of interest (0GHz to 40GHz) was chosen. This was repeated for a range of different hatch widths, and the optimum out of these was then chosen. Figure 4. S-parameter results of parameterised search of hatched ground plane across all parameters Figure 3. Reflectance results of parameterised search of hatched ground plane across all parameters ","simulation-setup#Simulation setup":" Image 19. Automatically generated hatched ground plane for openEMS simulation Image 20. Automatically generated hatched ground plane 3D model Various geometries were auto-generated by a Python script which produced image files with different hatch configurations. These were then given to gerber2ems to simulate using openEMS. A parametric search over the hatch width and gap amount for the optimum search was performed. "},"title":"Hatched ground"},"/oculink_m2_adapter/docs/design/open_ems/taper/":{"data":{"":"","discussion#Discussion":" Doesn’t simulate dielectric loss or skin effect which is important for predicting how lossy the design is, especially at higher frequencies where these effects are significant. Right now the gerber2ems script uses a perfect conductor as the metal material, however openEMS has ConductingSheet which simulates conductivity for lossy conductors. Limited resolution of the openEMS simulation meant that the infinitely pointy taper could not be simulated. This probably resulted in inaccurate simulated performance at higher frequencies. Limitations This taper is supposed to be used to transition from the transmission line on the FR4 PCB to the flexible polyimide PCB. The thickness of the copper layer would need to be considered, however due to bugs in the gerber2ems simulation setup it is difficult to guarantee stable/correct results when connecting the micro stripline simulation port to a 3D metal mesh. An accurate simulation would require adding in the FR4 stackup and polyimide stackup including the solder bridge connecting the two PCB together. This would require gerber2ems to support much more complicated stackups. A hatched ground plane would need to be added to simulate how the taper behaves with a hatched ground plane. ","parameter-search#Parameter search":" Figure 6. S-parameter results of parameterised search of taper ground plane with a hatch width of 150um Figure 5. Reflectance results of parameterised search of taper ground plane with a hatch width of 150um The configuration with the lowest mean energy loss in our frequency range of interest (0GHz to 40GHz) was chosen. This was repeated for fixed width and length parameters, then for fixed width paramters, after which the optimum was then chosen. Figure 8. S-parameter results of parameterised search of taper ground plane across all parameters Figure 7. Reflectance results of parameterised search of taper ground plane across all parameters ","simulation-setup#Simulation setup":" Image 21. Automatically generated taper ground plane for openEMS simulation Image 22. Automatically generated taper ground plane 3D model Various geometries were auto-generated by a Python script which produced image files with different hatch configurations. These were then given to gerber2ems to simulate using openEMS. A parametric search over the width, length and overlap amount for the optimum search was performed. The overlap was a percentage of the length of the taper. E.g. [0.5, 1.0, 1.5]. "},"title":"Taper"},"/oculink_m2_adapter/docs/design/reference_designs/":{"data":{"":"","adtlink-m2-to-oculink-card#Adtlink M.2 to Oculink card":" Image 4. Adtlink F4C M.2 to Oculink adapter card (source) Image 5. Purchased Adtlink F4C M.2 to Oculink adapter card with modifications Adtlink PCIe 4.0 eGPU Oculink dock [PERST, CLKREQ] are connected. [PEWAKE, PEDET] are not connected. [SMB_CLOCK, SMB_DATA] are connected. [MFG_CLOCK, MFG_DATA] are not connected. 3.3V is connected. REFCLK is connected with same polarity. [PERxy, PETxy] lanes are connected with opposite polarity and opposite order. ","adtlink-m2-to-pcie-extension#AdtLink M.2 to PCIe extension":" Image 2. Adtlink M.2 to PCIe 4.0 adapter (source) Adtlink M.2 PCIe x4 extension cable schematic (source) [CLKREQ, PERST] are connected. [PEWAKE, PEDET] are not connected. [SMB_CLOCK, SMB_DATA] are not connected. [MFG_CLOCK, MFG_DATA] are not connected. 3.3V is connected. REFCLK is connected with same polarity. [PERxy, PETxy] lanes are connected with same polarity and same order. ","gpd-win-v1-m2-to-oculink-card#GPD Win v1 M.2 to Oculink card":" Image 3. GPD win 1 M.2 to Oculink adapter card (source) Gpdwin1 M.2 to Oculink adapter schematic (source) [PERST, PEDET] are connected. CLKREQ is connected but through a Schottky diode. PEWAKE is not connected. [SMB_CLOCK, SMB_DATA] are not connected. [MFG_CLOCK, MFG_DATA] are not connected. 3.3V is connected through a jumper. REFCLK is connected with same polarity. [PERxy, PETxy] lanes are connected with same polarity and same order. ","points-to-verify#Points to verify":" Do you wire from PERxy on the M.2 side to PERxy on the Oculink side, or PERxy to PETxy? Do all of the control signals need to be connected? Is SMB (system management bus) data and clock required or is it optional? What about the MFG (manufacturer) data and clock on the M.2 card which is not present on the Oculink connector or PCIe standard? Is lane reordering and polarity inversion okay to use for routing PCIe connections? ","summary#Summary":" PERST must be connected. CLKREQ must be connected, possibly through a diode, or shorted to ground on host side. PERST is optional. PEWAKE is not connected (might be optional?). [SMB_CLOCK, SMB_DATA] are optional. [MFG_CLOCK, MFG_DATA] are not connected. 3.3V is connected. REFCLK must be connected with same polarity. [PERxy, PETxy] can be connected in opposite polarity and/or opposite order. "},"title":"Reference designs"},"/oculink_m2_adapter/docs/design/single_board/":{"data":{"":"","advantages#Advantages":"Simpler design Easier manufacturing and testing since we only need to solder the Oculink port and passive components. Single KiCAD schematic required allowing for easier design inside single project. Requires only a single transmission line to be designed reducing design complexity. More reliable performance Having multiple boards connected over a flexible PCB adds additional potential impedance discontinuities. Without equipment to verify performance at PCIe 3.0+ frequencies it is difficult to validate performance. Introducing fewer design uncertainties will make final performance more likely to align with calculations. ","disadvantages#Disadvantages":"Narrow routing resulting in layer transition PCIe signal lanes have to fit through a very narrow region which requires routing differential pairs onto other layers.\nRequires careful design of via jumps to prevent impedance mismatch and signal reflection. PCIe RX lanes have 1 via jump and PCIe TX lanes have 2 via jumps. Each additional via jump will worsen signal integrity so having 2 is unideal. Port location and bending Board has to be slightly bent so that Oculink port is at the correct height with laptop chassis.\nMight result in damage to circuit if the board isn’t flexible enough. Could result in degraded transmission line performance due to stretching of traces and introduction of inter-pair skew in differential pairs. Could result in Oculink port pad connection breaking due to uneven mechanical stress. Long distance routing PCIe lanes have to be routed over a moderately long distance (12cm).\nWe are using FR4-TG135 which has a high dielectric loss at high frequencies. If we are targetting PCIe 4.0 then we need to handle the 5th harmonic of the fundemental frequency which is 40GHz. It is highly unlikely to maintain PCIe 4.0 over such a long distance with a high loss dielectric. Large size Single board design is relatively large.\nM.2 slot requires 0.8mm thickness which results in mandatory lead free HASL that costs $4.80USD. Exceeds 50mm x 50mm threshold meaning board goes from $2.00USD to $7.00USD. Exceeds 100mm x 100mm threshold meaning additional engineering fee of $24.00USD. Overall cost of $35.80USD. ","images#Images":" Image 9. Custom single board M.2 to Oculink adapter PCB Image 10. Custom single board M.2 to Oculink adapter 3D render "},"title":"Single board design"},"/oculink_m2_adapter/docs/design/transmission_line/":{"data":{"":" Structures Via fence Via jumps Skin effect Skew requirements Hatched ground plane Flex connection Calculations "},"title":"Transmission line"},"/oculink_m2_adapter/docs/design/transmission_line/calculations/":{"data":{"":"","jlcpcb-data#JLCPCB data":"Soldermask Location Thickness (mil) Thickness (mm) Laminate 1.2 0.03048 Traces 0.6 0.01524 Dielectric constant = 3.8\nCore dielectric Dielectric constant = 4.6\nJLCPCB impedance control stackup information JLCPCB impedance calculator guide JLC04081H-3313 Stackup Name breakdown Part Meaning 04 4 layer 08 8mm thickness 1 1oz outer copper H half (0.5oz) inner copper 3313 3133 prepreg Stackup information Layer Material Type Thickness (mm) Trace Copper 0.035 Prepreg 3313x1 0.0994 Inner Layer Copper 0.0152 Core Core 0.45 Inner Layer Copper 0.0152 Prepreg 3313x1 0.0994 Trace Copper 0.035 Core material properties Nan Ya Plastics NP-155F (4 to 8 layers)\nCore Thickness (mm) εr 0.08 3.99 0.10 4.36 0.13 4.17 0.15 4.36 0.20 4.36 0.25 4.23 0.30 4.41 0.35 4.36 0.40 4.36 0.45 4.36 0.50 4.48 0.55 4.41 0.60 4.36 0.65 4.36 0.70 4.53 \u003e 0.70 4.43 Prepreg Source 1 Prepreg Type Resin Content Nominal Thickness (mil) εr 7628 49% 8.6 4.4 3313 (2313) 57% 4.2 4.1 1080 67% 3.3 3.91 2116 54% 4.9 4.16 Source 2 Prepreg type Dielectric constant 7628 4.6 3313 4.05 2116 4.25 Impedance calculator results JLCPCB impedance calculator\nParameter Value Layers 4 Thickness 0.8mm Inner copper weight 0.5oz Outer copper weight 1.0oz Stackup JLC04081H-3313 NOTE: Core is 0.5mm instead of expected 0.45mm which might reduce accuracy of calculations.\nTrace thicknesses Impedance (Ω) Type Config Trace width (mm) Trace spacing (mm) Distance coplanar (mm) 85 Coplanar differential pair with ground L1-L2 0.1549 0.15 0.15 85 Coplanar differential pair with ground L2-L3-L4 0.1334 0.15 0.15 42.5 Coplanar single ended with ground L1-L2 0.1971 N/A 0.15 42.5 Coplanar single ended with ground L2-L3-L4 0.1679 N/A 0.15 ","sierra-circuits-calculations#Sierra circuits calculations":"Sierra circuits impedance calculator\nPrepreg dielectric material property Rigid - FR408HR - Prepreg\nParameter Value Dielectric thickness 4.2? Construction 1x3313-59% Resin content 59% Frequency (GHz) Dielectric constant Dissipation factor 1 3.58 0.009 2 3.57 0.009 5 3.55 0.010 10 3.54 0.010 20 3.54 0.010 Coplanar stripline differential pair with ground plane Impedance calculator\nParameter Value Configuration L2-L3-L4 L2-L3 dielectric height (mm) 0.0994 L2-L3 dielectric constant 3.55 L3-L4 dielectric height (mm) 0.45 L3-L4 dielectric constant 4.4 L3 Trace thickness (mm) 0.01524 L3 Trace separation (mm) 0.15 Conductor spacing (mm) 0.15 Conductor width (mm) 0.6 Dielectric covering tracks L2-L3 Input parameter Input value Output parameter Output value Zdiff (Ω) 85 Trace width (mm) 0.1372 Trace width (mm) 0.1334 Zdiff (Ω) 85.88 Coplanar soldermask coated microstrip differential pair with ground plane Impedance calculator\nParameter Value Configuration L1-L2 L1-L2 dielectric height (mm) 0.0994 L1-L2 dielectric constant 3.55 Soldermask substrate height (mm) 0.03048 Soldermask trace height (mm) 0.01524 Soldermask dielectric constant 3.8 Trace thickness (mm) 0.035 Trace separation (mm) 0.15 Conductor spacing (mm) 0.15 Conductor width (mm) 0.6 Input parameter Input value Output parameter Output value Zdiff (Ω) 85 Trace width (mm) 0.1676 Trace width (mm) 0.1549 Zdiff (Ω) 88.18 Coplanar stripline single ended with ground plane Impedance calculator\nParameter Value Configuration L2-L3-L4 L2-L3 dielectric height (mm) 0.0994 L2-L3 dielectric constant 3.55 L3-L4 dielectric height (mm) 0.45 L3-L4 dielectric constant 4.4 L3 Trace thickness (mm) 0.01524 Conductor spacing (mm) 0.15 Conductor width (mm) 0.6 Dielectric covering tracks L2-L3 Input parameter Input value Output parameter Output value Zdiff (Ω) 42.5 Trace width (mm) 0.174 Trace width (mm) 0.1679 Zdiff (Ω) 43.27 Coplanar soldermask coated microstrip singled ended with ground plane Impedance calculator\nParameter Value Configuration L1-L2 L1-L2 dielectric height (mm) 0.0994 L1-L2 dielectric constant 3.55 Soldermask substrate height (mm) 0.03048 Soldermask trace height (mm) 0.01524 Soldermask dielectric constant 3.8 Trace thickness (mm) 0.035 Conductor spacing (mm) 0.15 Conductor width (mm) 0.6 Input parameter Input value Output parameter Output value Zdiff (Ω) 42.5 Trace width (mm) 0.2 Trace width (mm) 0.1971 Zdiff (Ω) 44.5 "},"title":"Calculations"},"/oculink_m2_adapter/docs/design/transmission_line/flex_connection/":{"data":{"":"","stackup-height-differences#Stackup height differences":" Diagram 18. JLCPCB FR4 stackup vs flexible PCB stackup (source) Transitioning our transmission line from an FR4 stackup to a flexible PCB stackup causes the height of the dielectric in the transmission line to significantly decrease.\nTherefore signal trace to ground plane capacitance increases which causes impedance to decrease. Mismatch in impedance causes signal reflections and reduced integrity. Hatched ground plane If the transmission line signal traces have the same width, using a suitably designed hatched ground plane will increase the impedance to meet our impedance target.\nSee designing hatched ground plane for more details. See simulating hatched ground plane for more details. ","structure-of-transmission-line#Structure of transmission line":" Diagram 15. Differential pair with coplanar ground plane stitched with via fence The following are useful equations to describe the impedance of the transmission line in relation to it’s geometry. These will be useful in determining which parameters to adjust if we want to meet our PCIe impedance target. This comes at the cost of lower modularity but is this is an acceptable compromise for higher guarantees of high frequency signal performance.\nCharacteristic impedance Rough equation for a simple transmission line is given by:\n\\[ Z_0 = \\sqrt{\\frac{L}{C}} \\]\nThis is still useful when discussing changes in impedance for a variety of transmission line structures if we discuss them in terms of differing trace inductances and capacitances.\nUniversity of San Diego: Waves and impedances on transmission_lines Parallel plate capacitors The capacitance between a simple two plate system is given by: \\[ C = \\frac{\\epsilon_0 A}{d} \\]\nDiagram 16. Parallel plate capacitor (source) Wire over plane The inductance of a wire over a plane can be approximated as: \\[ L = \\frac{\\mu_0 \\mu_r d}{2 \\pi} cosh^{-1}{\\frac{h}{2r}} \\]\nDiagram 17. Solid wire over ground plane (source) ","type-of-connection#Type of connection":"Flexible flat/printed cable connector Image 17. Molex FFC/FPC connector (source) Advantages Disadvantages Flexible connector can be replaced without resoldering the connector. Allows for easier installation and removal without danger of damaging flexible connector. Requires designing transmission line to gracefully transition to the connector without a large impedance discontinuity. Higher insertion loss compared to soldered connection since contact surface isn't perfect and there will be stubs from the internal connectors. This could hamper high frequency performance. Maximum usable frequency before insertion loss is more than 3dB is usually below 20GHz. This is the recommended design frequency for a good eye opening for PCIe 3.0 which has a fundemental frequency of 4GHz. Requires reflow soldering the connector which is extremely difficult for a fine pitch connector (0.2mm) without risk of bridging. Connectors add a few extra dollars of cost to the bill of materials Molex: FFC/FPC connector maximum usable frequency and compatability with high speed USB (source) Soldered connection Advantages Disadvantages Allows for more control over the design of the transmission line structure Lower insertion loss since connection is soldered. This means no stubs caused by extra internal connector pins or non-ideal/non-uniform contact surface. Connector SMD pads can be designed specifically to avoid discontinuities in impedance caused by trace length mismatch, loss of coplanar ground traces or ground plane. Low tolerance for z-height error on pad connections requires soldering the connector very flat to the SMD pads. This may require pressure during the reflow process Requires hand positioning of flexible connector onto pads which is extremely difficult since the traces are only 0.1mm. Any pitch error will result in possible bridging or degraded signal integrity Flexible pcb is not removable and is permanently connected to the boards. This might make installation or removal more difficult if connector is in a suboptimal location. Final choice The soldered connection allows closer control over the design of the tranmission line and avoids the downsides of a FFC connector. This should allow us to avoid or mitigate the signal integrity issues that will arise from the use of a FFC connector.","vertical-transmission-line-connection#Vertical transmission line connection":" Diagram 19. JLCPCB transmission line connection between FR4 stackup and flexible PCB Transition from FR4 stackup to flexible PCB involves a vertical solder connection which produces an impedance discontinuity.\nThe coplanar ground traces experience some discontinuity when it meets the solder connection due to an increase in the conductor height. Results in an increase in edge coupling area. This increases capacitance and decreases impedance. The E-fields between the signal traces and ground planes have to switch layers. Broadside coupling means stronger E-fields and more energy being carried compared to the coplanar ground traces which use edge coupling. Capacitive coupling is greater through a broadside connection since the traces are 0.1mm wide, compared to the edge side coupling which occurs over a 0.012mm or 0.035mm This was verified through an open EMS simulation. Tapered connection Image 18. Flexible PCB transmission line taper A taper is a gradual change in the geometry of a transmission line that attempts to maintain consistent impedance value across a geometric transition.\nWe use a linear taper to transition the E-field broadside coupling from the ground plane on the M.2 card to the ground plane on the flexible PCB. A linear taper is not necessarily the best however it is very simple to design. Altium: How to design an RF taper for impedance matching Other taper designs have complex non-linear equations describing their shape which is difficult to import/design using KiCAD. Linear taper just requires the polyline tool in KiCAD. Parametric optimisation of taper To verify the performance of the taper openEMS was used.\nSimulated stackup with flex PCB connected to FR4 transmission line as a 3 layer board. Layers were: [FR4 ground, signal traces, flex PCB ground]. The soldered signal traces were approximated as an ideal single trace on a single layer. This was done so that only the E-field transition between the ground planes was relevant for our parametric search. Might not be ideal from a simulation accuracy standpoint as the geometry of the solder connection might impact the impedance match. However representing the solder connection in our simulation setup was difficult so this approximation/assumption was used. Parametric search was done on the length, width, and amount of overlap of the linear taper. Shape of taper was modified separately on the FR4 stack up and flexible PCB stackup. Possible that simulation was not accurate since mesh size is limited and linear taper requires very small simulation grid size to accurately capture the pointy part. "},"title":"Flex connection"},"/oculink_m2_adapter/docs/design/transmission_line/hatched_ground_plane/":{"data":{"":"","additional-design-considerations#Additional design considerations":"Refer to minimising intra-pair skew for hatched ground planes and differential pairs.","determining-parameters#Determining parameters":"There are three major parameters to consider:\nTrace width. Hatch width. Hatch gap. Since we need to be above the minimum trace width for JLCPCB to manufacture it, we should select a fixed trace width of 0.1mm.\nThis is similar the trace width of 0.13mm for our transmission line on the FR4 substrate for both the M.2 cad and Oculink port board. This means we will have an easier time designing a taper geometry when connecting the flex connector to our boards (discussed here). Means we only need to perform a parametric search with two variables (the hatch width and gap) which is less time consuming. ","hatched-ground-plane#Hatched ground plane":" Hatched ground plane can allow for wider traces while matching impedance. No easy equation to get impedance measurement (fill factor approximation does not model this adequately). Design of hatched ground plane must meet manufacturing capabilities of JLCPCB. Requires parametric search with simulation software. Refer to this section about simulating circuits with openEMS. ","problems-with-thin-flexible-pcb#Problems with thin flexible PCB":" The base polyimide dielectric core has a thickness of 25um. This means that we need extremely thin traces with a solid ground plane if we want to reach our PCIe impedance target. Thicker dielectric cores are provided but they increase cost substantially and trace width barely increases. Even worse the calculated transmission line trace width is calculated as 0.05mm which is below JLCPCB’s manufacturing minimums. "},"title":"Hatched ground plane"},"/oculink_m2_adapter/docs/design/transmission_line/skew_requirements/":{"data":{"":"The PCIe standard specifies several requirements for differential pair skew.","inter-pair-skew-between-lanes#Inter-pair skew (between lanes)":"Inter-pair skew is usually not specified but has a lower bound of 1ns for PCIe 4.0.\nAssuming a propagation speed of 0.6c, the inter-pair skew is around 20cm. Since this is such a large value the inter-pair skew requirement is difficult to violate. The reason for this is because the PCIe standard states that transceivers have to do symbol synchronisation. Usually done with a buffer which usually can store around 20 symbols for each lane. For PCIe 4.0 at a transfer rate of 16GT/s, 20 symbols have a duration of 1.25ns. ","intra-pair-skew-within-lane#Intra-pair skew (within lane)":"Intra-pair skew must be less than 5 mils (0.127mm) which is rather small margin of error. The following are phenomena that can contribute to intra-pair skew and methods to mitigate them.\nBends in transmission line Diagram 11. Techniques to length match differential pair (source) Bending causes the lengths of differential traces to become shorter and longer resulting in skew. Can be avoided by keeping bends short so local skew error is below 5 mils. If skew error is too large than it should be immediately corrected near the bend by adding serpentine bends for the shorter side of the differential pair. KiCAD can automatically do this using their skew correction tool. Fibre weave effect Diagram 12. Asymmetric routing over fibre-weave can produce intra-pair skew (source) Diagram 13. Asymmetric routing over fibre-weave will degrade eye opening (source) Signal integrity: Beware of the skew budget with fibre weave effect Cadence: The fibre weave effect, skew, losses and resonance A poor choice of a dielectric with a non-uniform fibre weave pattern can result in large intra-pair skews. There is also no method of designing the circuit around a bad fibre weave since the manufacturer cannot position the weave at a specific offset. Better fibre weave patterns Image 13. Fibre weave patterns that are available from manufacturers (source) Image 14. Mechnically compressed fibre glass with flattened weave pattern (source) There should be careful selection of an appropriate fibre weave pattern for maximum uniformity. Additionally there is also mechanically compressed fibre glass which flattens the weave and fills in any gaps to produce a uniform weave pattern. Here is a pdf from Isola group who are a copper clad laminate and prepreg materials manufacturer. Isola group: Fibre weave patterns (source) It contains various high quality images of fibre weave patterns and their fill factor measurements. They also include treatment processes for bonding the prepreg and core to copper layers and how that effects the copper smoothness which is relevant for skin effect. JLCPCB controlled impedance stackup Image 15. JLCPCB fibre glass weave patterns for controlled impedance stackups (source) JLCPCB offers a variety of fibre weave patterns when a multilayer controlled impedance stackup is requested (this is also free). It is also possible to stack two or more fibre weaves vertically to increase overall density and improve uniformity. Hatched ground plane Diagram 14. Balanced and unbalanced routing of differential pair over hatched ground plane For hatched ground planes in a flexible pcb design asymmetric routing can produce large intra-pair skews. For straight transmission line routes it is trivial to route the differential pair symmetrically. However if the transmission line needs to bend then the hatched ground plane needs to warp to avoid introducing skew. This is exceptionally difficult to do with KiCAD’s built in hatched ground fill tool. Requires manual layout and distortion of hatched ground plane to accomodate bends in a differential pair. Image 16. Manually warped hatched ground plane with differential pair bend Unfortunately KiCAD’s built in skew correction tools cannot measure skew for hatched ground planes generated manually or automatically by their ground fill tool. This makes verification of the intra-lane skew extremely difficult at the design stage. "},"title":"Skew requirements"},"/oculink_m2_adapter/docs/design/transmission_line/skin_effect/":{"data":{"":" Diagram 10. Visualisation of skin effect on rough conductive surfaces (source) Skin effect is when the signal current is expelled to the surface of the conductor at high frequencies. With a rough copper finish, skin effect can result in higher trace impedance which can result in: Signal loss through resistive losses. Impedance mismatch and signal reflections. Evident Scientific: Copper foil surface roughness for 5G PCBs ","copper-finish#Copper finish":" PCB manufacturers have a variety of copper foil types to use if you need a smoother surface to avoid skin effect. Altium: Types of PCB copper foils for high frequency design Altium: Copper choice and efficiency for high frequency PCB design Type of copper foil Description Roughness Electrodeposited Has a rougher surface on one side of the copper foil Highest (above 1 um) Reverse treated Uses a surface treatment to reduce roughness Moderate (0.5 um to 1.5 um) Rolled-annealed Has a smoother, denser surface from a rolling process Low (0.25 to 0.5 um) Ultra-low profile Additional treatments are used to reduce roughness Lowest (comparable to rolled annealed, but can be less than 0.3 um) Unfortunately JLCPCB doesn’t allow you to select the type of copper foil. ","increasing-trace-width#Increasing trace width":" Use wider tranmission line signal traces to improve impedance and therefore signal integrity at higher frequencies. Comes at the cost of worse impedance matching at lower frequencies. Signal losses generally occur at higher frequencies (via jumps, tapered transitions, skin effect, insertion loss, dielectric loss). Therefore to achieve best performance over the entire bandwidth we should increase transmission line width to mitigate skin effect at higher frequencies. "},"title":"Skin effect"},"/oculink_m2_adapter/docs/design/transmission_line/structures/":{"data":{"":"PCIe receive and transmit lanes and reference clock are high frequency differential signals. There are many possible designs for a differential transmission line.\nDiagram 3. Differential pair topologies (source) ","best-design#Best design":"The following should be used for an optimal differential pair transmission line:\nSolid ground plane Coplanar guard traces Via fence Through this we should be able to reduce crosstalk, handle common mode noise, and reduce EMI emissions even with tightly packed PCIe lanes.","common-mode-noise#Common mode noise":"In theory a perfectly balanced differential pair would only need two conductors to handle the symmetrical current path however this should not be relied upon.\nCommon mode noise can arise due to power supply differences between host and device. This is especially important because we have a laptop powered by a USB C dock and an eGPU powered by a separate power supply. Without a ground plane or coplanar ground trace the return current for the common mode signal may be over a large loop area. This can pickup interference from environmental sources and harm signal integrity. Increases amount of EMI induced in signal traces within that loop area. ","crosstalk#Crosstalk":"Given our tight routing requirements our PCIe lanes would be extremely close together by only a few multiples of the trace width. This means we need to be very careful about inter-lane crosstalk.\nCan be fixed by increasing separation between lanes which is not possible given our tight space requirements. Adding a ground plane to confine the electric field generated by the differential pair (almost always helps). Adding coplanar guard traces to separate adjacent lanes and add additional E-field confinement. Sometimes can worsen crosstalk if guard trace is high impedance and functions closer to a resonant tank than a ground trace. Can be improved by turning coplanar guard traces into a via fence by stitching them to a ground plane This guarantees coplanar guard trace is low impedance. Also adds additional grounding with vias which further improves E-field confinement and prevents inter-lane crosstalk. ","resources#Resources":" Layout guidelines for PCIe Gen 4.0 (source) "},"title":"Structures"},"/oculink_m2_adapter/docs/design/transmission_line/via_fence/":{"data":{"":" Diagram 5. Via fence ","crosstalk#Crosstalk":" Improves impedance of coplanar ground guard trace by stitching it to a ground plane which improves E-field confinement. Additional ground vias improve E-field confinement. Both of these contribute to significantly reducing the inter-lane crosstalk. ","manufacturing-limitations#Manufacturing limitations":"JLCPCB has manufacturing constraints that limits the geometry of our via fence. The following values are chosen to minimise the manufacturing cost and therefore may not be the best values we can choose.\nParameter Type Value Via hole size Minimum 0.3mm Via hole diameter Minimum 0.4mm Via hole to different net distance Minimum 0.2mm Via hole to hole spacing Minimum 0.2mm Since we are targetting PCIe 4.0 our spacing requirement is 0.46mm and is within the manufacturing constraints. Our coplanar guard traces are placed 0.1mm away from signal traces so we only need 0.1mm of copper between the via and edge of coplanar guard trace. ","resources#Resources":" Effectiveness of PCB perimeter via fencing (source) Altium: Adding via stitching \u0026 via shielding Hackaday: RF \u0026 Via Stitching/Fencing ","spacing-requirements#Spacing requirements":" If spacing is incorrect it can result in worse crosstalk since fence can behave like a resonant tank. For a given maximum frequency which needs to be blocked, the equation is given as follows. \\[ \\begin{align} d_{spacing} \u0026= \\frac{\\lambda_{min}}{8} \\\\ d_{spacing} \u0026= \\frac{c}{8 \\sqrt{\\epsilon_r} \\times f_{max}} \\end{align} \\]\nFor the best eye opening we should set the maximum frequency as the 5th harmonic of the PCIe fundemental frequency. The following spacing values are calculated with \\( \\epsilon_r = 4.1 \\) for FR4.\nGen \\( f_{0} \\) (GHz) \\( f_{max} \\) (GHz) \\( d_{spacing} \\) (mm) 1.0 1.25 6.25 2.96 2.0 2.5 12.5 1.48 3.0 4.0 20 0.93 4.0 8.0 40 0.46 5.0 16.0 80 0.23 "},"title":"Via fence"},"/oculink_m2_adapter/docs/design/transmission_line/via_jumps/":{"data":{"":" Via jumps are necessary if a transmission line needs to switch lanes. In order to avoid signal reflections the characteristic impedance of the transmission line needs to remain constant when traversing from between layers through a via. ","buried-blind-and-through-hole-vias#Buried, blind and through hole vias":" Diagram 9. Buried, blind and through hole vias (source) Buried and blind vias can be used to avoid via stubs. These types of vias can be manufactured using a technique called backdrilling. However JLCPCB only supports through hole vias. ","coaxial-via#Coaxial via":" Diagram 6. Via jump with current path (red/blue) and E-field (yellow) If there are no nearby grounding vias then a distant current return path is used which results in a significant impedance mismatch. Instead we add nearby grounding vias to provide a current return path. This type of via structure is called a coaxial via. The following parameters are important when trying to control the impedance of a coaxial via: Distance of ground vias from signal via. Number of ground vias around the signal via. Hole size of the ground via and signal via. Dielectric material used to fill the vias. ","determining-parameters#Determining parameters":" There is no closed form equation for the impedance of a coaxial via with a teardrop taper. This means running a parametric search through a simulation to determine the optimal parameter values. Very difficult to do given the number of parameters for the coaxial via and teardrop taper which all impact performance. Refer to this section about simulating circuits with openEMS. ","resources#Resources":" Sierra Circuits: Coaxial via geometry Samtec blog: Practical strategies to mitigate return loss from via stubs Altium: Stubs and backdrilling in high speed design ","teardrop-taper#Teardrop taper":" Diagram 7. Via jump design with teardrop taper When a signal trace goes through a via there is an impedance discontinuity especially if the trace width and via diameter are different. Adjusting the following can reduce the impedance discontinuity: Adding a teardrop taper to match trace width to via diameter. Adjusting the via annular diameter. Adjusting the via hole size. ","via-stubs#Via stubs":" Diagram 8. Via stub back drilling (source) If via jump isn’t between the top and bottom layers then there will be a stub segment in the via. This will have the most signficant impact at the following frequency: \\[ f_0 = \\frac{c}{4 \\sqrt{\\epsilon_r} \\times d_{stub}} \\]\nActual performance degradation happens well before this frequency. By decreasing \\( d_{stub} \\) we can increase \\( f_0 \\) well past our maximum design frequency and avoid problems. If the via stub is sufficiently short then it will not have a noticeable impact on signal integrity below our maximum design frequency. "},"title":"Via jumps"},"/oculink_m2_adapter/docs/manufacturing/":{"data":{"":" Ordering Reflow soldering Electrical testing "},"title":"Manufacturing"},"/oculink_m2_adapter/docs/manufacturing/electrical_testing/":{"data":{"":"","flexible-pcb-multi-board-design#Flexible PCB multi board design":"Validation of flexible PCB design will be done in three passes.\nImage 12. Custom M.2 to Oculink adapter with flex connector 3D renders 1. Oculink port board After Oculink port has been soldered to PCB perform similar checks as with the single board design. Instead of using the M.2 connection use the exposed flexible PCB SMD pads to test for shorts or bad electrical connections. 2. Flexible PCB to Oculink port After soldering flexible PCB to Oculink port board perform the same check but with the exposed flexible PCB pads on the M.2 side of the flexible PCB. Perform visual checks of the flexible PCB at the soldered connection. Since the polyimide is translucent it is possible to detect solder bridges. If there are any shorts or bad connections they are likely isolated to the flexible PCB connection since we have already verified the Oculink port itself. 3. Flexible PCB to M.2 port After soldering flexible PCB to M.2 card perform same check as with the single board design. Perform visual checks of the flexible PCB at the soldered connection. Since the polyimide is translucent it is possible to detect solder bridges. If there are any shorts or bad connections they are likely isolated to the flexible PCB connection on the M.2 card side. Due to steps 1 and 2 the Oculink port and flexible PCB connection on the Oculink board side are verified. ","single-board-validation#Single board validation":" Oculink port has a small pitch of 0.2mm which can easily create solder bridges. Validate this by connecting the Oculink port to the unpowered PCIe eGPU board. Refer to M.2 pinout and PCIe pinout for the electrical connections to test for. Depending on the design the PCIe lanes may be connected in opposite polarity and/or in opposite orders. Check for short circuits and bad connections. Use a magnifying glass to position multimeter probes onto the exposed electrical contacts. "},"title":"Electrical testing"},"/oculink_m2_adapter/docs/manufacturing/ordering/":{"data":{"":" Note\nAll prices are listed in $USD.","components#Components":"The components for both the single board design and multi-board flexible PCB design are identical.\nPart Unit Cost Quantity Total Amphenol Oculink port (G14A42121B12HR) $3.50 1 $3.50 SOD52 Schottky diode $0.25 1 $0.25 X7R 040 10nF MLCC $0.05 5 $0.25 Total $4.00 Components were ordered from Mouser Australia. There are minimum order quantities for the Oculink port connector which has a MOQ of 5. Price of extra components are not considered since we are just interested in cost of a completed M.2 to Oculink adapter board. ","jlcpcb#JLCPCB":"Single board design 0.8mm thickness 4 layers 120mm by 80mm Part Cost Base $2.00 4 layer 0.8mm stackup required HASL finish $4.80 4 layer stackup above 50mmx50mm $5.00 Engineering cost of boards above 100mmx100m $24.00 Total $35.80 Flexible PCB design M.2 card 0.8mm thickness 4 layers 22mm x 42mm Part Cost Base $2.00 4 layer 0.8mm stackup required HASL finish $4.80 Total $6.80 Oculink port board 1.6mm thickness 4 layers 87mm x 21mm Part Cost Base $2.00 4 layer stackup above 50mmx50mm $5.00 Total $7.00 Flexible PCB 0.11mm thickness 2 layers 83mm by 77mm Part Cost Base $2.00 Total $2.00 Total cost of all boards Board Cost M.2 card $6.80 Oculink port board $7.00 Flexible PCB $2.00 Total $15.80 "},"title":"Ordering"},"/oculink_m2_adapter/docs/manufacturing/reflow_soldering/":{"data":{"":"","equipment#Equipment":" Reflow soldering plate. Soldering iron with a conical tip. Magnifying glass. Isopropyl alcohol. Metal tweezers. Image 23. Mechanic IX5 reflow heating plate Image 24. TS-100 soldering iron ","instructions#Instructions":"Reflow soldering components Apply stencil for Oculink connector and capacitors to spread solder paste. Visually check to make sure there are no bridges or missing solder paste on SMD pads. Place oculink port carefully onto SMD pads as to align them correctly. Follow reflow profile with a target temperature of 220°C and keep it there for 60 seconds before ramping it down. Visually confirm that there are no solder bridges on visible connections. Validate that there are no shorts or bad connections following electrical testing. Due to simple design of circuit the complications should only occur with the Oculink port itself. Here excessive or insufficient solder paste can result in short circuits or a missing electrical connection. Repeat steps 1 to 5 until the Oculink port is soldered correctly. For the flexible PCB design continue to the following instructions below.\nSoldering flex connector This process is only required for the two part board which is connected over the flexible PCB.\nPerform reflow soldering of components for each of the two boards as described above. Tin the SMD connection pads on both the flexible PCB and M2 card and Oculink port board. Make sure that there is a minimal amount of solder to prevent shorts when reflow soldering connector. Check to see if amount of solder has same height across all pads. If there isn’t remove it until it is level. Focus on the Oculink port board first and preheat it to 140°C. Preheat the soldering iron with the conical tip to 280°C. Using metal tweezers carefully position the flexible connector to align with the SMD pads. Add flux to the flexible connector and board will help keep the connector in place once aligned. Do this under a magnifying glass with mechanical helper hands. Using the soldering iron solder the ground SMD pads after alignment. Be careful to not misalign the connector. Increase the preheating temperature of the board to 150°C or above if soldering isn’t occuring. Avoid preheating the board to too high of a temperature otherwise solder may become molten and components and Oculink port can be knocked off. Avoid keeping the board preheated for too long otherwise PCB will discolour. Make sure that you have soldered enough of the ground pads to keep the connector in place. Let the Oculink port board cool down and check that flexible PCB is mechanically secure enough to move assembly around. At this step there is no sound electrical connection between the board and flexible PCB. We only need it to be mechanically secure so we can perform the full reflow step under mechanical pressure. Place a weight on top of the flexible PCB connection to equally apply force on the SMD pads. The weight should cover the entire flexible PCB connection pads. The weight should not melt at the reflow temperature of 220°C. The weight should be secure and stationary during reflow process. Perform reflow soldering of the flexible PCB connection while the connections are under constant force. Since there are no spring contacts, the z-height tolerance of the connection is very low. To guarantee a good electrical connection the reflow process has to occur while the pads are under compressive pressure. Be careful not to disturb the existing connections such as the Oculink port and capacitors. Perform electrical tests as described in electrical testing. This is done to make sure shorts don’t occur due at the flexible PCB connection with the Oculink port board. If shorts do occur at this step repeat steps 1 to 10 with less solder on the pads. If these is a missing electrical connection make sure that sufficient pressure has been applied during reflow. Repeat setps 1 to 10 for the M.2 card. ","reflow-profile#Reflow profile":" Set a target temperature on the Mechanic IX5 reflow plate. Activate the reflow process which will increase the temperate by 1°C each second until target temperature is reached. Once the reflow temperature is reached let it remain at this temperature until reflow has finished. Allow the PCB to cool which decrease temperature by 1°C each second until it is cool enough to handle. Figure 9. Different reflow profiles for lead free solder (source) The Mechanic IX5 can be used to follow an arbitrary reflow profile (including the shown trapezoidal or delta types). The delta type reflow profile is sufficient for the Oculink port."},"title":"Reflow soldering"},"/oculink_m2_adapter/docs/results/":{"data":{"":" Installation Synthetic benchmarks Discussion "},"title":"Results"},"/oculink_m2_adapter/docs/results/discussion/":{"data":{"":"","aliexpress-pcie-40-adapters#Aliexpress PCIe 4.0 adapters":" ❮ ❯ Both the adapters that came with the Adtlink eGPU and the silver plated 12cm adapter reached PCIe 4.0 speeds. PCIe 4.0 connection was stable and bandwidth reached theoretical values. Performance uplift from PCIe 3.0 to PCIe 4.0 in this setup is significant. Bandwidth limit from eGPU to CPU limits the number of frames that can be sent to display. ","display-setup#Display setup":"sequenceDiagram; participant eGPU participant CPU participant USB 4 dock participant 1080p monitor CPU-\u003e\u003eeGPU: Oculink PCIe TX eGPU-\u003e\u003eCPU: Oculink PCIe RX CPU-\u003e\u003eUSB 4 dock: 40Gb/s USB 4 cable USB 4 dock-\u003e\u003e1080p monitor: HDMI cable Benchmark output display is connected to a USB 4 dock (40Gb/s) and has a resolution of 1080p. This means Oculink PCIe connection has to be stable in both the transmit and receive direction. When eGPU data comes back to CPU it actually goes through the integrated AMD 680m based on copy activity in task manager. ","flexible-pcb-and-single-board-design#Flexible PCB and single board design":" ❮ ❯ Both the flexible PCB multi-board design and single board design achieved PCIe 3.0 speeds. Their results across all synthetic benchmarks were identical. PCIe 3.0 connection was stable and bandwidth reached theoretical values. PCIe 4.0 could not be achieved at all. "},"title":"Discussion"},"/oculink_m2_adapter/docs/results/installation/":{"data":{"":"","aliexpress-pcie-40-adapter#Aliexpress PCIe 4.0 adapter":" Image 25. Aliexpress M.2 Oculink PCIe 4.0 silver plated extension cable (source) Image 30. Aliexpress PCIe 4.0 Oculink adapter installed in laptop Aliexpress adapter extension is made of micro-coaxial cable. These can be bent to fit inside the laptop chassis and routed underneath the M.2 2280 SSD. ","flexible-pcb-multi-board-adapter#Flexible PCB multi board adapter":" Image 26. Flexible PCB multi-board Oculink adapter installed in laptop Image 27. Flexible PCB multi-board Oculink adapter and M.2 SSD installed in laptop M.2 2280 SSD is removed so flexible PCB can be routed under it. M.2 card and Oculink port board are screwed. Oculink port board can be positioned to perfectly match the routed Oculink port hole in the laptop chassis. M.2 2280 SSD is installed ontop of the flexible PCB. ","oculink-port#Oculink port":" Image 29. Oculink port exposed on laptop Oculink port hole was created by drilling with tungsten drill bits. Multiple drill holes were used to create a rough opening and then sanded down into the correct shape. ","single-board-adapter#Single board adapter":" Image 28. Single board Oculink adapter installed in laptop Doesn’t require routing of cables under M.2 slot. Port was positioned differently in later designs, but Oculink connection can still be made by bending the board slightly. "},"title":"Installation"},"/oculink_m2_adapter/docs/results/synthetic_benchmarks/":{"data":{"":"","3dmark#3DMark":" Name AMD 680M AMD 5700XT PCIe3 AMD 5700XT PCIe4 PCIe Bandwidth (GB/s) 11.2 3.53 6.39 Fire Strike 6155 19512 23577 Night Raid 23554 35831 52358 Steel Nomad 444 1950 2030 Steel Nomad Light 2308 7299 8218 Time Spy 2762 8093 9051 Wild Life 15622 35637 54329 Wild Life Extreme 4523 15497 18682 ❮ ❯ ","aida64#Aida64":" Name AMD 680M AMD 5700XT PCIe3 AMD 5700XT PCIe4 Read Pinned (GB/s) 34.1 3.38 6.7 Read Pageable (GB/s) 11.7 3.37 6.71 Write Pinned (GB/s) 34.1 3.38 6.7 Write Pageable (GB/s) 11.7 3.37 6.71 ","furmark-2#Furmark 2":" Name AMD 680M AMD 5700XT PCIe3 AMD 5700XT PCIe4 Donut OpenGL 1797 6513 8015 Donut Vulkan 1370 6037 7453 Knot OpenGL 618 2208 2226 Knot Vulkan 641 3063 3393 ❮ ❯ ","gpu-z#GPU-Z":" Name AMD 680M AMD 5700XT PCIe3 AMD 5700XT PCIe4 PCIe Interface Gen 4.0 x 16 Gen 3.0 x 4 Gen 4.0 x 4 ","unigine#Unigine":" Name AMD 680M AMD 5700XT PCIe3 AMD 5700XT PCIe4 Valley Extreme 914 4611 4684 Heaven Extreme 747 2845 3342 Superposition Medium 4214 13345 16527 Superposition High 3172 10532 12130 Superposition Extreme 1425 4659 5027 ❮ ❯ "},"title":"Synthetic benchmarks"},"/oculink_m2_adapter/docs/specifications/":{"data":{"":" PCIe Specification M.2 to Oculink "},"title":"Specifications"},"/oculink_m2_adapter/docs/specifications/components/":{"data":{"":"","m2-card#M.2 card":" Usually used for M.2 SSDs in laptop or desktop motherboards. Pins follow the PCIe specification for x4 lanes. Diagram 2. M.2 card size standards (source) Table 1. M.2 connector pinout (source) ","oculink-port#Oculink port":" Follows the SFF-9402 specification which is compatible with PCIe SFF-9402 specification (source) Female port is rated for 10000 insertion cycles. Male cable is rated at a minimum of 50. Compatible with the PCIe specification for x4 or x8 lanes. Wider x8 lane variant is not as useful since no M.2 slot as of yet supports PCIe x8 lanes. Amphenol Oculink port datasheet (source) Image 1. Amphenol oculink port (source) Table 2. Amphenol Oculink connector pinout (source) "},"title":"M.2 to Oculink"},"/oculink_m2_adapter/docs/specifications/pcie_specification/":{"data":{"":"","maximum-design-frequency#Maximum design frequency":"For a good eye opening the transmissions lines should be designed for 5x the fundemental frequency. For PCIe 4.0 the fundamental frequency is 8GHz which means an ideal maximum design frequency of 40GHz.\nDiagram 4. Eye diagram (source) ","pcie-generations#PCIe generations":" With differential signalling the fundemental frequency is half the transfer rate. An encoding scheme of xb/yb means X bits out for Y bits in. 8b/10b: 1 start bit, 8 data bits, 1 end bit. 128b/130b: 1 start bit, 128 data bits, 1 end bit. Gen Freq (GHz) Transfers (GT/s) Encoding Bitrate (Gb/s/lane) 1.0 1.25 2.5 8b/10b 2.0 2.0 2.5 5.0 8b/10b 4.0 3.0 4.0 8.0 128b/130b 7.88 4.0 8.0 16.0 128b/130b 15.75 5.0 16.0 32.0 128b/130b 31.51 PCIe: 8 Things You Need to Know Early ","pcie-pinout#PCIe pinout":" Differential signalling along receive (RX) and transmit (TX) lanes. Polarity of lanes can be inverted. Order of lanes can be reversed between host and device. Number of RX and TX lanes must be the same (symmetrical). Allows for more flexible routing in space constrained environment. Reference clock is provided from host for timing and synchronisation (100MHz). Polarity cannot be swapped. Supposed to be optional but is actually mandatory for almost all devices. CLKREQ is pull downed by device to request PCIe reference clock. PERST is used to reset the PCIe link. PEWAKE is used by device to signal to host to wake up (maybe for network cards?). SMBCLK and SMBDAT is the system management bus and is an I2C interface (optional?) Diagram 1. PCIe x4 connector pinout (source) "},"title":"PCIe Specification"}}